<style lang="less" scoped>
    .agreement-layout {
        height: 500px;
        overflow-y: scroll
    }
</style>
<template>
    <div class="agreement-layout">
        <h3>一、总则</h3>

        <p>1-1.用户在注册之前，应当仔细阅读本协议，并同意遵守本协议后方可成为注册用户。一旦注册成功，则用户与{{site}}之间自动形成协议关系，用户应当受本协议的约束。用户在使用特殊的服务或产品时，应当同意接受相关协议后方能使用。</p>

        <p>1-2.本协议则可由{{site}}随时更新，用户应当及时关注并同意本站不承担通知义务。本站的通知、公告、声明或其它类似内容是本协议的一部分。</p>

        <p>1-3.在以下条款中，”用户”是指向注册成为本站及旗下产品会员的个人或者单位。</p>

        <h3>二、内容所有权</h3>

        <p>2-1.本软件产品的所有版权都归{{site}}所有，受《中华人民共和国计算机软件保护条例》等知识产权法律及国际条约与惯例的保护。通过本协议获得本软件的使用权。</p>

        <p>2-2.未经{{site}}的书面授权，用户不能以任何目的(包括学习或研究等目的)，以任何方式和媒介复制、转载和传播提供给第三人或公众使用。</p>

        <p>2-3.用户禁止以任何形式的重新分发，更不得利用非法重新分发获利。也不得对本软件进行出租、租借、发放许可证、出售或抵押。</p>

        <h3>三、会员身份确认</h3>

        <p>3-1.用户承诺并保证自己是具有完全民事行为能力和完全民事权利能力的自然人、法人、实体和组织。用户在此保证所填写的用户信息是真实、准确、完整、及时的，并且没有任何引人误解或者虚假的陈述，且保证本站可以通过用户所填写的联系方式与用户取得联系。</p>

        <p>3-2.用户应根据本站对于相关服务的要求及时提供相应的身份证明等资料，否则本站有权拒绝向该会员或用户提供相关服务。</p>

        <p>3-3．用户注册成功后将得到一个用户名和密码，用户凭用户名和密码享受本站向其会员用户提供的产品和服务。</p>

        <p>3-4.用户将对用户名和密码安全负全部责任，并且用户对以其用户名进行的所有活动和事件负全责。用户有权根据本站规定的程序修改密码</p>

        <p>3-5.非经本站书面同意，用户名和密码不得擅自转让或者授权他人使用，否则用户应承担由此造成的一切后果。</p>

        <p>3-6.用户若发现任何非法使用用户帐号或存在安全漏洞的情况，请立即通告本站。</p>

        <h3>四、用户资料隐私保护</h3>

        <p>4-1.保护用户隐私是{{site}}的一项基本政策，{{site}}保证不对外公开或向第三方提供用户注册资料及用户在使用网络服务时存储在{{site}}的非公开内容，但下列情况除外：</p>

        <p>（a）事先获得用户的明确授权；</p>

        <p>（b）根据有关的法律法规要求；</p>

        <p>（c）按照相关政府主管部门的要求；</p>

        <p>（d）为维护社会公众的利益；</p>

        <p>（e）为维护{{site}}的合法权益。</p>

        <p>4-2.{{site}}可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与{{site}}同等的保护用户隐私的责任，则{{site}}可将用户的注册资料等提供给该第三方。</p>

        <p>4-3.在不透露单个用户隐私资料的前提下，{{site}}有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>

        <h3>五、服务条款的修改和服务体系修订</h3>

        <p>本站有权在必要时修改服务条款，本站服务条款一旦发生变动，将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以主动取消获得的网络服务。如果用户继续享用本站网络服务，则视为接受服务条款的变动。本站保留随时修改其服务体系和价格而不需通知用户的权利，本站修改其服务和价格体系之前用户就具体服务与本站达成协议并已按照约定交纳费用的，本站将按照已达成的协议执行至已交纳费用的服务期期满。<p>

        <h3>六、用户的权利和义务</h3>

        <p>6-1.用户有权利拥有自己在本站的用户名和密码并有权利使用自己的用户名和密码随时登录本站网站的会员专区。</p>

        <p>6-2.用户有权利享受本站提供的互联网技术和信息服务，并有权利在接受本站提供的服务时获得本站的技术支持、咨询等服务，服务内容详见本站相关产品介绍。</p>

        <p>6-3.用户保证不会利用技术或其他手段破坏及扰乱本站网站以及本站其他客户的网站。</p>

        <p>6-4.用户应尊重本站及其他第三方的知识产权和其他合法权利，并保证在发生上述事件时尽力保护本站及其股东、雇员、合作伙伴等免于因该等事件受到影响或损失；本站保留用户侵犯本站知识产权时终止向该用户提供服务并不退还任何款项的权利。</p>

        <p>6-5.对由于用户向本站提供的联络方式有误以及用户用于接受本站邮件的电子邮箱安全性、稳定性不佳而导致的一切后果，用户应自行承担责任，包括但不限于因用户未能及时收到本站的相关通知而导致的后果和损失。</p>

        <p>6-6.用户保证其使用本站服务时将遵从国家、地方法律法规、行业惯例和社会公共道德，不会利用本站提供的服务进行存储、发布、传播如下信息和内容：违反国家法律法规政策的任何内容（信息）；违反国家规定的政治宣传和/或新闻信息；涉及国家秘密和/或安全的信息；封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的信息；博彩有奖、赌博游戏；违反国家民族和宗教政策的信息；防碍互联网运行安全的信息；侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容。用户同时承诺不得为他人发布上述不符合国家规定和/或本服务条款约定的信息内容提供任何便利，包括但不限于设置URL、BANNER链接等。用户承认本站有权在用户违反上述时有权终止向用户提供服务并不予退还任何款项，因用户上述行为给本站造成损失的，用户应予赔偿。</p>

        <h3>七、责任声明。</h3>

        <p>7-1.用户同意自己承担使用本软件产品的风险，在适用法律允许的最大范围内，{{site}}在任何情况下不就因使用或不能使用本软件产品所发生的特殊的、意外的、非直接或间接的损失承担赔偿责任。即使用户已事先被{{site}}告知该损害发生的可能性。</p>

    </div>
</template>
<script>
export default {
    data() {
        return {
            site: AppData.site.organization
        }
    }
}
</script>

